
import { Code } from 'lucide-react';
import { EducationalModule } from '../types';

export const algorithmModules: EducationalModule[] = [
  { 
    id: 1, 
    title: "Ալգորիթմների տարրերի կիրառում", 
    icon: Code, 
    status: 'completed', 
    progress: 100,
    topics: [
      "Ալգորիթմի սահմանում և հիմնական հատկությունները",
      "Գծային ալգորիթմներ",
      "Պայմանական կառուցվածքներ",
      "Ճյուղավորված ալգորիթմներ",
      "Կոմբինացված պայմաններ",
      "Ընտրության ալգորիթմ (switch-case)",
      "Ցիկլեր, նրանց տեսակները",
      "For ցիկլը և նրա կիրառումը",
      "While և do-while ցիկլեր",
      "Բազմակի ցիկլեր",
      "Ռեկուրսիա և նրա աշխատանքի սկզբունքը",
      "Հանրահաշվական արտահայտություններ",
      "Տրամաբանական արտահայտություններ",
      "Թվաբանական գործողություններ",
      "Մուտքի և ելքի գործողություններ",
      "Փոփոխականներ և տիպեր",
      "Հաստատուններ",
      "Տվյալների փոխակերպում",
      "Ալգորիթմների բարդության գնահատում",
      "Փնտրման ալգորիթմներ",
      "Գծային որոնում",
      "Երկուական որոնում",
      "Տեսակավորման ալգորիթմներ",
      "Ներդրման տեսակավորում",
      "Փուչիկի տեսակավորում",
      "Ընտրության տեսակավորում",
      "Խառնարդի տեսակավորում",
      "Միաձուլման տեսակավորում",
      "Արագ տեսակավորում",
      "Տվյալների կառուցվածքներ, զանգվածներ",
      "Բլոկ-սխեմաներ",
      "Կեղծ կոդի գրելաձև"
    ]
  }
];
